from selenium.webdriver.common.by import By

# Локатор 1
# Кнопка отправки формы логина
bad_1 = (By.CSS_SELECTOR, ".bg-blue-500.hover\\:bg-blue-700.text-white.font-bold.py-2.px-4.rounded")
# Локатор является плохим, по причине, того, что захардкожено на стиль кнопки, при первом же изменении
# стиля локатор начнет падать

good_1 = (By.CSS_SELECTOR, "#submit_button")

# Локатор 2
# Поле ввода email на форме регистрации
bad_2 = (By.XPATH, "/html/body/div[1]/main/form/div[2]/input")
# Локатор является плохим, по причине, того, что при первом изменении структуры страницы, локатор будет падать

good_2 = (By.XPATH, "//input[contains(text(),'email')]")

# Локатор 3
# Первая карточка товара в каталоге
bad_3 = (By.CSS_SELECTOR, "div")
# Локатор является плохим, по причине, того, что в случае если добавят другой див в начале, локаторов будет ловить новый,
# а не нужный нам

good_3 = (By.CSS_SELECTOR, ".product-card:first-child")

# Локатор 4
# Сообщение об ошибке валидации
bad_4 = (By.ID, "error_msg_8273b2af")
# Локатор является плохим по причине, того, что id элемента сгенерирован автоматически, и вполне возможно будет меняться
# из раза в раз, из-за чего, локатор не будет находить сообщение

good_4 = (By.ID, "error_msg")

# Локатор 5
# Кнопка "Войти" в шапке (есть на всех страницах)
bad_5 = (By.XPATH, "//*[contains(text(), 'Войти в систему ШопМаркет — это бесплатно')]")
# Локатор является плохим по причине, того, что, в случае если будут менять текст кнопки, локатор перестанет её находить

good_5 = (By.CSS_SELECTOR, "[aria-label='Войти'")

# Локатор 6
# Кнопка «Заблокировать» для строки пользователя test_user в админке
bad_6 = (By.XPATH, "//button[1]")

# Локатор является плохим, по причине, того, что, в случае если добавят новую кнопку, локатор будет ловить её,
# а не искомую

good_6 = (By.ID, "block_button")
